; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-7)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 room5)
(at ball7 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
(at ball7 room5)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 2 of 7
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 2 of 7
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 7
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 2 of 7
5. (drop ball1 room5 right)
   deleted: (carry ball1 right)
   added: (at ball1 room5) (free right)
   goals met: 3 of 7
6. (drop ball2 room5 left)
   deleted: (carry ball2 left)
   added: (at ball2 room5) (free left)
   goals met: 4 of 7
7. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 4 of 7
8. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 4 of 7
9. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 4 of 7
10. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 4 of 7
11. (drop ball4 room5 right)
   deleted: (carry ball4 right)
   added: (at ball4 room5) (free right)
   goals met: 5 of 7
12. (drop ball5 room5 left)
   deleted: (carry ball5 left)
   added: (at ball5 room5) (free left)
   goals met: 6 of 7
13. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 6 of 7
14. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 6 of 7
15. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 6 of 7
16. (drop ball3 room5 left)
   deleted: (carry ball3 left)
   added: (at ball3 room5) (free left)
   goals met: 7 of 7
